programacao-para-internet/php_files/public_html/codigos/examples/chapter31/listing31.2.txt

<?xml version="1.0" encoding="UTF-8"?>
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
                  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <namesp1:AsinSearchRequest
                  xmlns:namesp1="urn:PI/DevCentral/SoapService">
      <AsinSearchRequest xsi:type="m:AsinRequest">
        <asin >0060518057</asin>
        <tag >your-associate-id</tag>
        <type >heavy</type>
        <dev-tag >your-dev-tag</dev-tag>
      </AsinSearchRequest>
    </namesp1:AsinSearchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>